cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/devel-only'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'olafurpg/scalafmt'
tap 'Goles/battery'
tap 'homebrew/dupes'

cask 'launchcontrol'
cask 'java'
cask 'rdm'
cask 'google-drive'
cask 'google-photos-backup'
cask 'genymotion'
cask 'whatsapp'
cask 'sizeup'
cask 'transmission'
brew 'docker-compose', service_restart: true
brew 'docker'
brew 'findutils', args: ["--with-default-names"]
brew 'gnu-tar', args: ["--with-default-names"]
brew 'gnu-sed', args: ["--with-default-names"]
brew 'gnu-which', args: ["--with-default-names"]
brew 'gnutls', args: ["--with-default-names"]
brew 'gnupg'
brew 'gnupg2'
brew 'gpg-agent'
brew 'grep', args: ["--with-default-names"]
brew 'binutils'
brew 'diffutils'
brew 'nmap'
brew 'battery'
brew 'spark'
brew 'reattach-to-user-namespace'
brew 'sbt'
brew 'scala'
brew 'olafurpg/scalafmt/scalafmt'
brew 'tree'
brew 'ack'
brew 'ant'
brew 'autoconf'
brew 'automake'
brew 'awscli'
# brew 'cabal-install'
brew 'camlp4'
brew 'mongodb', service_restart: true
brew 'chruby'
brew 'cloc'
brew 'cloog'
brew 'closure-compiler'
brew 'cmake'
brew 'flow'
brew 'curl'
brew 'httpie'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'dirmngr'
brew 'elinks'
brew 'emacs', args: ['with-cocoa'] # to link to /Applications, `brew linkapps emacs`
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'fswatch'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
# brew 'ghc'
brew 'gifsicle'
brew 'git', args: ['with-pcre']
brew 'glib'
brew 'gmp'
brew 'go'
brew 'htop-osx'
brew 'httping'
brew 'httrack'
brew 'ievms'
brew 'iftop'
brew 'imagemagick'
brew 'isl'
brew 'jpeg'
brew 'json-c'
brew 'lame'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libusb-compat'
brew 'libvo-aacenc'
brew 'libyaml'
brew 'macvim'
brew 'libyubikey'
brew 'links'
brew 'makedepend'
brew 'mariadb'
brew 'memcached'
brew 'mldonkey'
brew 'mobile-shell'
brew 'mpfr'
brew 'neovim/neovim/neovim', args: ['HEAD', 'with-release']
brew 'nettle'
brew 'nginx', service_restart: true
brew 'ocaml'
brew 'openssl'
brew 'optipng'
brew 'ossp-uuid'
brew 'pcre'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'pngquant'
brew 'postgresql'
brew 'potrace'
brew 'protobuf'
brew 'pstree'
brew 'pth'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'qemu'
# brew 'qt'
brew 'ragel'
brew 'readline'
brew 'redis', service_restart: true
brew 'rhino'
brew 'ruby-install'
brew 's3cmd'
brew 'shellcheck'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux', args: ['HEAD']
brew 'unar'
brew 'v8'
# brew 'valgrind'
brew 'vim', args: ['HEAD', 'with-luajit', 'with-override-system-vi']
brew 'watch'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'ykpers'
brew 'zsh'
brew 'nailgun'
brew 'watchman'
brew 'fzf', args: ['HEAD']
brew 'gradle'
brew 'homebrew/devel-only/elm-format', args: ['HEAD']

cask '1password-beta'
cask 'arq'
cask 'bartender'
cask 'dropbox'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'chrome-remote-desktop-host'
cask 'hammerspoon'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'karabiner-elements'
cask 'mailmate'
cask 'omnidisksweeper'
cask 'skype'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'tcl'
cask 'vlc'
cask 'xquartz'
cask 'keycastr'
cask 'rowanj-gitx'

#
# mas (Mac App Store)
#
# mas is a neat idea, but in practice worse than just clicking
# around in the app. Several apps fail to install, and others
# are invisible to the search (replaced by newer, paid versions).
#
#mas 'Diagrammix', id: 418534796
#mas 'Fantastical', id: 975937182
#mas 'Kindle', id: 405399194
#mas 'Marked 2', id: 890031187
#mas 'Net Monitor', id: 480482806
# ScreenFlow 4 (not listed) -> (now) ScreenFlow 6
#mas 'Skitch', id: 425955336
#mas 'Textual 5', id: 896450579
#mas 'The Unarchiver', id: 425424353 # Fails
#mas 'Wunderlist', id: 410628904 # Fails
# xScope (not listed) -> (now) xScope 4

