{
  "Dockerfile.vim": { "branch": "master" },
  "JavaScript-Indent": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "NrrwRgn": { "branch": "master" },
  "ReplaceWithRegister": { "branch": "master" },
  "Vim-Jinja2-Syntax": { "branch": "master" },
  "animation.nvim": { "branch": "main" },
  "auto_mkdir": { "branch": "master" },
  "bufdelete.nvim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lsp-document-symbol": { "branch": "main" },
  "cmp-nvim-lsp-signature-help": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-under-comparator": { "branch": "master" },
  "cmp-zsh": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "colorful-winsep.nvim": { "branch": "alpha" },
  "committia.vim": { "branch": "master" },
  "dart-vim-plugin": { "branch": "master" },
  "dial.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "fidget.nvim": { "branch": "main" },
  "firenvim": { "branch": "master" },
  "flutter-tools.nvim": { "branch": "main" },
  "fold-preview.nvim": { "branch": "main" },
  "git-messenger.vim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "glow-hover": { "branch": "main" },
  "goto-preview": { "branch": "main" },
  "guard-collection": { "branch": "main" },
  "guard.nvim": { "branch": "main" },
  "gundo.vim": { "branch": "master" },
  "haskell-vim": { "branch": "master" },
  "haunted.vim": { "branch": "master" },
  "hlargs.nvim": { "branch": "main" },
  "impatient.nvim": { "branch": "main" },
  "iron.nvim": { "branch": "master" },
  "is.vim": { "branch": "master" },
  "java.nvim": { "branch": "main" },
  "javascript-libraries-syntax.vim": { "branch": "master" },
  "keymap-amend.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "lir-git-status.nvim": { "branch": "main" },
  "lir.nvim": { "branch": "master" },
  "lsp_codelens_extensions.nvim": { "branch": "main" },
  "lsp_extensions.nvim": { "branch": "master" },
  "lsp_lines.nvim": { "branch": "main" },
  "lsp_signature.nvim": { "branch": "master" },
  "luv-vimdocs": { "branch": "main" },
  "luvit-meta": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "matchparen.nvim": { "branch": "main" },
  "middleclass": { "branch": "master" },
  "neovim-ayu": { "branch": "master" },
  "nightfox.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "notifier.nvim": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
  "null-ls.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-repl-highlights": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-jdtls": { "branch": "master" },
  "nvim-lastplace": { "branch": "main" },
  "nvim-lsp-installer": { "branch": "main" },
  "nvim-lsp-ts-utils": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-luaref": { "branch": "main" },
  "nvim-metals": { "branch": "main" },
  "nvim-navic": { "branch": "master" },
  "nvim-neoclip.lua": { "branch": "main" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-scrollbar": { "branch": "main" },
  "nvim-semantic-tokens": { "branch": "master" },
  "nvim-spectre": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-terminal.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-hint-textobject": { "branch": "master" },
  "nvim-ufo": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "overseer.nvim": { "branch": "master" },
  "pinnacle": { "branch": "main" },
  "playground": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "popup.nvim": { "branch": "master" },
  "promise-async": { "branch": "main" },
  "rust-tools.nvim": { "branch": "master" },
  "spellrotate.vim": { "branch": "master" },
  "splitjoin.vim": { "branch": "main" },
  "sqls.nvim": { "branch": "main" },
  "stay-in-place.nvim": { "branch": "main" },
  "symbols-outline.nvim": { "branch": "master" },
  "tabline.vim": { "branch": "master" },
  "tabular": { "branch": "master" },
  "telescope-dap.nvim": { "branch": "master" },
  "telescope-file-browser.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-fzf-writer.nvim": { "branch": "master" },
  "telescope-fzy-native.nvim": { "branch": "master" },
  "telescope-github.nvim": { "branch": "master" },
  "telescope-hop.nvim": { "branch": "master" },
  "telescope-live-grep-args.nvim": { "branch": "master" },
  "telescope-rs.nvim": { "branch": "master" },
  "telescope-sg": { "branch": "main" },
  "telescope-symbols.nvim": { "branch": "master" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "telescope_hoogle": { "branch": "master" },
  "textobj-word-column.vim": { "branch": "master" },
  "tint.nvim": { "branch": "master" },
  "toggleterm.nvim": { "branch": "main" },
  "tokyodark.nvim": { "branch": "master" },
  "transparent.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "tsc.nvim": { "branch": "main" },
  "typescript-vim": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-anzu": { "branch": "master" },
  "vim-argwrap": { "branch": "master" },
  "vim-asterisk": { "branch": "master" },
  "vim-boxdraw": { "branch": "master" },
  "vim-characterize": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-dispatch": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-godot": { "branch": "master" },
  "vim-javascript": { "branch": "master" },
  "vim-javascript-syntax": { "branch": "master" },
  "vim-json": { "branch": "master" },
  "vim-jsx-typescript": { "branch": "master" },
  "vim-lion": { "branch": "master" },
  "vim-liquid": { "branch": "master" },
  "vim-metarepeat": { "branch": "master" },
  "vim-move": { "branch": "master" },
  "vim-mscgen": { "branch": "master" },
  "vim-mustache-handlebars": { "branch": "master" },
  "vim-projectionist": { "branch": "master" },
  "vim-ps1": { "branch": "master" },
  "vim-qf": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-scriptease": { "branch": "master" },
  "vim-searchindex": { "branch": "master" },
  "vim-solidity": { "branch": "master" },
  "vim-startify": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-syntax-extra": { "branch": "master" },
  "vim-textobj-entire": { "branch": "master" },
  "vim-textobj-indent": { "branch": "master" },
  "vim-textobj-line": { "branch": "master" },
  "vim-textobj-url": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" },
  "wezterm-types": { "branch": "main" },
  "windows.nvim": { "branch": "main" },
  "zig.vim": { "branch": "master" }
}
